"""
Блок 1.2.4 Присваивание (короткие формы).
=   # базовое
+=  # добавление
-=  # вычитание
*=  # умножение
/=  # деление
//= # целочисленное деление
%=  # остаток от деления
**= # возведение в степень
"""

x = 5
print(x)
x += 2  # 7
print(f"x += 2 # 7,x = {x}")
x -= 4  # 3
print(f"x -= 4  # 3,x = {x}")
x *= 2  # 6
print(f"x *= 2 # 6,x = {x}")
print(f"# int, {type(x)}")  # int
x /= 1.5  # 4
print(f"x /= 1.5  # 4,x = {x}")
print(f"# float, {type(x)}")  # float
x = int(x)
print(f"# int,x = {x}, {type(x)}")  # int
x //= 3  # 1
print(f"# 1,x = {x}")
x -= -1  # 2
print(f"# 2,x = {x}")
x **= 10  # 1024
print(f"# 1024,x = {x}")
